trade_exp/src/InformationRegisters/ПорогиФорматовМД/ПорогиФорматовМД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="119b6100-a8e4-475f-af37-9e331ae75d1e">
  <name>ПорогиФорматовМД</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="b8474b1f-7b29-4d3e-9b64-b03fcd179d90">
    <name>Порог1</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4e2ff841-4335-43eb-901b-567e9a59ea44">
    <name>Порог2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7816eb15-5450-47b0-89d9-18daceeaf6ae">
    <name>Порог3</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="53cd957d-3f86-4ae3-b8f5-a92b99c7aee9">
    <name>Процент1</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bb3135f6-f9a0-4abd-bc13-29b74ac790b5">
    <name>Процент2</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0badddb0-c1ad-431f-8ebc-0f04d9de7dd4">
    <name>Процент3</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e7e389e4-493f-4001-b9f5-2aeb43982eb6">
    <name>Процент4</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8721279e-07d6-48b2-a5ad-484444e04159">
    <name>ПроцентНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="15cceb8d-c2df-4f4d-9c9d-72bb30d97405">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4983049c-3b1d-4257-8c59-a74681689b60">
    <name>Инициатор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="e6f94149-626c-4876-9b45-81f3a55e7aa1">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="69dbb3f8-e6cc-4aa6-b078-044feed80ef6">
    <name>ЦеноваяГруппа_Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f467fa40-cb01-4193-b75f-f339e2444059">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c70a42dd-aa48-4d1f-9ee5-f2ce993256ca">
    <name>Формат</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ПорогиФорматовМД/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СоздатьПоТоварнойГруппе(Команда)
	
	ОткрытьФорму("РегистрСведений.ПорогиФорматовМД.ФормаЗаписи",Новый Структура("ТипЗаписи",1));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_ТоварнаяКатегория(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_ТоварнаяКатегория", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_ТоварнаяКатегория());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла_Номенклатура(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиИзФайла_Номенклатура", ЭтотОбъект);
	ПараметрыФормы= Новый Структура;
	ПараметрыФормы.Вставить("ДополнительныеРеквизиты",Новый Структура("Инициатор","СправочникСсылка.Пользователи#Инициатор#10")); 
	ПараметрыФормы.Вставить("НастройкиТаблицы", СтруктураТаблицы_Номенклатура());
	ОткрытьФорму("Обработка.ЗагрузкаИзВнешнегоФайла_Альтерра.Форма.ФормаПроизвольная", ПараметрыФормы, ЭтотОбъект, , ,
		, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПоНоменклатуре(Команда)
	ОткрытьФорму("РегистрСведений.ПорогиФорматовМД.ФормаЗаписи",Новый Структура("ТипЗаписи",0));
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыиФункции

&НаКлиенте
Функция СтруктураТаблицы_ТоварнаяКатегория()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
	"СправочникСсылка.ЦеновыеГруппыМД#Ценовая группа#30#1#Справочники.ЦеновыеГруппыМД.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("Формат", "СправочникСсылка.ФорматыПодразделений#Формат#20#1#Справочники.ФорматыПодразделений.НайтиПоНаименованию(""&Ячейка&"")#Формат");
	СтруктураТаблицы.Вставить("Порог1", "число#Порог 1#8");
	СтруктураТаблицы.Вставить("Порог2", "число#Порог 2#8");
	СтруктураТаблицы.Вставить("Порог3", "число#Порог 3#8");
	СтруктураТаблицы.Вставить("Процент1", "число#% наценки 1#10");
	СтруктураТаблицы.Вставить("Процент2", "число#% наценки 2#10");
	СтруктураТаблицы.Вставить("Процент3", "число#% наценки 3#10");
	СтруктураТаблицы.Вставить("Процент4", "число#% наценки 4#10");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Функция СтруктураТаблицы_Номенклатура()

	СтруктураТаблицы=Новый Структура;
	СтруктураТаблицы.Вставить("ЦеноваяГруппа_Номенклатура",
		"СправочникСсылка.Номенклатура#Номенклатура#30#1#Справочники.Номенклатура.НайтиПоНаименованию(""&Ячейка&"")#ЦеноваяГруппа_Номенклатура");
	СтруктураТаблицы.Вставить("Регион", "СправочникСсылка.РегионыПрисутствия#Регион#20#1#Справочники.РегионыПрисутствия.НайтиПоНаименованию(""&Ячейка&"")#Регион");
	СтруктураТаблицы.Вставить("Формат", "СправочникСсылка.ФорматыПодразделений#Формат#20#1#Справочники.ФорматыПодразделений.НайтиПоНаименованию(""&Ячейка&"")#Формат");
	СтруктураТаблицы.Вставить("ПроцентНоменклатура", "число#% наценки 1#5");
	
	Возврат СтруктураТаблицы;
КонецФункции

&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_Номенклатура(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры);

КонецПроцедуры


&НаКлиенте
Процедура ПослеЗагрузкиИзФайла_ТоварнаяКатегория(Результат, ДополнительныеПараметры) Экспорт

	ПослеЗагрузкиИзФайлаСервер_ТоварнаяКатегория(Результат, ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_ТоварнаяКатегория(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПорогиФорматовМД.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.ТипЗаписи=1;
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокТоварнаяКатегория.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПослеЗагрузкиИзФайлаСервер_Номенклатура(Результат, ДополнительныеПараметры)

	Если Не Результат = Неопределено Тогда
		ТаблицаДанных=ПолучитьИзВременногоХранилища(Результат);
		Если ТаблицаДанных <> Неопределено Тогда
			Для Каждого стр Из ТаблицаДанных Цикл
				МенеджерЗаписи=РегистрыСведений.ПорогиФорматовМД.СоздатьМенеджерЗаписи();
				заполнитьзначениясвойств(МенеджерЗаписи, стр);
				МенеджерЗаписи.Период=ТекущаяДатаСеанса();
				МенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
Элементы.СписокНоменклатура.Обновить();
КонецПроцедуры

#КонецОбласти
